let ex=document.getElementById("ex")
let D=new Date()
let Dayofnedel=D.getDay()
console.log()
const btnnext=document.getElementById("btnnext")
const btnback=document.getElementById("btnback")
const daynames=["понедельник", "вторник", "среда", "четверг", "пятница", "суббота"]
const jsonData={"ПМ2": {"1": {"PN": ["Мат.анализ(210)", "Философия(423)", " ", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", " ", " "], "PT": [" ", "Мат.анализ(210)", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "2": {"PN": ["Мат.анализ(210)", "Философия(423)", " ", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": [" ", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "3": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "", " ", " "], "SB": ["Ин.яз(210)", "Ин.яз(210)", " ", " ", " "]}, "4": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "программирование(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "5": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "программирование(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "6": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Философия(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "7": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "программирование(210)", " ", " "], "SB": ["графика(301)", "программирование(201)", " ", " ", " "]}, "8": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "программирование(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "9": {"PN": ["Мат.анализ(210)", "Философия(423)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Мат.анализ(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "10": {"PN": [" ", "физра(465)", " ", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["ЭВМ(210)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": [" ", " ", "Мат.анализ(210)", " ", " "], "SB": ["физра(465)", "физра(465)", " ", " ", " "]}, "11": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Мат.анализ(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "12": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", "Архитектура(201)", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Мат.анализ(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "13": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", " ", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Мат.анализ(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "14": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", " ", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", "Мат.анализ(210)", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "15": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", " ", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", " ", " ", " "], "SB": ["физра(465)", "физра(465)", " ", " ", " "]}, "16": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", " ", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "17": {"PN": ["Мат.анализ(210)", "физра(465)", "Ин.яз(210)", " ", " "], "VT": ["Архитектура(201)", "Философия(210)", "Дифф.уравнения(210)", " ", " "], "SR": ["физра(465)", "графика(301)", "программирование(210)", " ", " "], "CH": ["Дифф.уравнения(210)", "Мат.анализ(210)", " ", "ЭВМ(210)", " "], "PT": ["программирование(210)", "Мат.анализ(210)", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "18": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "19": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "20": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "21": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "22": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "23": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "24": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "25": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "26": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "27": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "28": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "29": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "30": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "31": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "32": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "33": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "34": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "35": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "36": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "37": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "38": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "39": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "40": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "41": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "42": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "43": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "44": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}, "45": {"PN": [" ", " ", " ", " ", " "], "VT": [" ", " ", " ", " ", " "], "SR": [" ", " ", " ", " ", " "], "CH": [" ", " ", " ", " ", " "], "PT": [" ", " ", " ", " ", " "], "SB": [" ", " ", " ", " ", " "]}}}



// текущая неделя
function getnedel() {
    const today = new Date();
    let year = today.getFullYear();
    const septemberFirst = new Date(year, 8, 1); 
    if (today < septemberFirst) {year -= 1;}
    const lastSeptemberFirst = new Date(year, 8, 1);
    const diffInMilliseconds = today - lastSeptemberFirst;
    let weeksPassed = Math.ceil(diffInMilliseconds / (1000 * 60 * 60 * 24 * 7));
    if (Dayofnedel==0){weeksPassed+=1;}
    return weeksPassed;
}
let teknedel=getnedel()
let peremnedel=getnedel()




// берем пары на нужный день по неделе
function getpara_po_nedel(nedel){
    ungrope = jsonData[Object.keys(jsonData)[0]][nedel]
    ungrope2=ungrope[Object.keys(ungrope).at(Dayofnedel%6)]
    for(i=0;i<5;i++){
        document.querySelector(`.para${i}`).textContent=ungrope2[i]
    }
    }
getpara_po_nedel(teknedel)



// инициализация дня
function DAYFUNC(){
    if(Dayofnedel==0){
        document.getElementById(`slide`).textContent=(daynames.at(0))+` ${peremnedel}`;
        console.log(Dayofnedel)
    }
    else if(Dayofnedel==6){
        document.getElementById(`slide`).textContent=(daynames.at(5))+` ${peremnedel}`;
        Dayofnedel--
    }
    else{
        document.getElementById(`slide`).textContent=(daynames.at(Dayofnedel-1))+` ${peremnedel}`;
        Dayofnedel--
    }
}
DAYFUNC()


// обновляет недели в полосе снизу
function slider_week_update(nedel){
    mass=[]
    for(var i=0;i<5;i++){
        n_nedel=nedel-2+i
        if (n_nedel<1){
            n_nedel=""
        }
        else if(n_nedel>45){
            n_nedel=""
        }
        mass.push(n_nedel)
        
    }
    document.querySelectorAll(".scroll-hide-weeks").forEach(function(el){
        el.classList.remove("scroll-hide-weeks")
        el.offsetWidth
        el.classList.add("scroll-hide-weeks")
    })
    document.getElementById("scroll-btn-1").textContent=`${mass.at(0)}`
    document.getElementById("scroll-btn-2").textContent=`${mass.at(1)}`
    document.getElementById("scroll-btn-3").textContent=`${mass.at(2)}`
    document.getElementById("scroll-btn-4").textContent=`${mass.at(3)}`
    document.getElementById("scroll-btn-5").textContent=`${mass.at(4)}`

}
slider_week_update(teknedel)

// обработка нажатия на кнопку и обновление пар выбраного дня недели
function btn_slide(action,nedel){
    ex.classList.remove("scroll-hide-slider")
    ex.offsetWidth
    ex.classList.add("scroll-hide-slider")
    setTimeout(function() {
        // Код, который выполнится через n секунду
        if (action==`back`){Dayofnedel-=1;}
        else if(action==`next`){Dayofnedel+=1;}
        tmp_Dayofnedel_after=Dayofnedel%6

        if (tmp_Dayofnedel_before==5 && tmp_Dayofnedel_after==0 || tmp_Dayofnedel_before==-1 && tmp_Dayofnedel_after==0){
        nedel++
        peremnedel++
        slider_week_update(peremnedel)}
        else if (tmp_Dayofnedel_before==0 && tmp_Dayofnedel_after==5 || tmp_Dayofnedel_before==0 && tmp_Dayofnedel_after==-1){
        nedel--
        peremnedel--
        slider_week_update(peremnedel)}

    document.getElementById("slide").textContent=(daynames.at(Dayofnedel%6))+` ${nedel}`;
    getpara_po_nedel(nedel)
      }, 200);
    tmp_Dayofnedel_before=Dayofnedel%6
}
// обновление всего
function updatenedel(nedel){
    peremnedel=nedel
    btn_slide("",nedel)
    slider_week_update(nedel)
}

// кнопки в слайдере
btnnext.addEventListener("click",function(){btn_slide(`next`,peremnedel);})
btnback.addEventListener("click",function(){btn_slide(`back`,peremnedel);})

// кнопки в scroll снизу(циферки)
document.getElementById("scroll-btn-1").addEventListener('click',function(){updatenedel(document.getElementById("scroll-btn-1").textContent)})
document.getElementById("scroll-btn-2").addEventListener('click',function(){updatenedel(document.getElementById("scroll-btn-2").textContent)})
document.getElementById("scroll-btn-3").addEventListener('click',function(){updatenedel(document.getElementById("scroll-btn-3").textContent)})
document.getElementById("scroll-btn-4").addEventListener('click',function(){updatenedel(document.getElementById("scroll-btn-4").textContent)})
document.getElementById("scroll-btn-5").addEventListener('click',function(){updatenedel(document.getElementById("scroll-btn-5").textContent)})

// кнопки в scroll снизу (стрелочки)
document.getElementById("scroll-btn-back").addEventListener('click',function(){slider_week_update(Number(document.getElementById("scroll-btn-3").textContent)-5)})
document.getElementById("scroll-btn-next").addEventListener('click',function(){slider_week_update(Number(document.getElementById("scroll-btn-3").textContent)+5)})